scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#include <Arduino.h>
#include <FS.h>
#include <LittleFS.h>

#include <ArduinoJson.h>
#include "ConfigSchema.h"
#ifdef ENABLE_PMACHINE
#include "pmachine.h"
#endif
#include "ffs/FederatedFileSystem.h"
#if defined(ESP32)
#include <SD.h>
#endif

#define CONFIG_PATH "/config.json"


struct ClusterConfig {
    String clusterId = "default";
    bool isGateway = false;
    static const FieldDescriptor schema[2];
    static constexpr size_t schemaSize = 2;
};

struct WifiConfig {
    String ssid = "";
    String password = "";
    static const FieldDescriptor schema[2];
    static constexpr size_t schemaSize = 2;
};

const FieldDescriptor ClusterConfig::schema[2] = {
    FIELD_DESC(ClusterConfig, clusterId, FieldType::StringType),
    FIELD_DESC(ClusterConfig, isGateway, FieldType::BoolType)
};
const FieldDescriptor WifiConfig::schema[2] = {
    FIELD_DESC(WifiConfig, ssid, FieldType::StringType),
    FIELD_DESC(WifiConfig, password, FieldType::StringType)
};

#define CONFIG_PATH "/config.json"
#define WIFI_CONFIG_PATH "/wifi.json"
#define NODE_NAME_PATH "/node_name.txt"

#if defined(ESP32)
#include <WiFi.h>
#include <WiFiUdp.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#endif
#include <ESPAsyncWebServer.h>

// Global config, PMachine, and FederatedFileSystem instances
ClusterConfig clusterConfig;
WifiConfig wifiConfig;
#ifdef ENABLE_PMACHINE
pmachine::PMachine pm;
#endif
FederatedFileSystem federatedFS;
bool ffsUp = false;


#include <map>
struct DiscoveredNode {
    String mac;
    String ip;
    unsigned long lastSeen;
};
std::map<String, DiscoveredNode> discoveredNodeTable;

AsyncWebServer server(80);
String nodeName = "esp32vm";



void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}

// ...existing code...

void setupWebServer() {
                #ifdef ENABLE_PMACHINE
                    // PMachine file open
                    server.on("/pmachine/file/open", HTTP_POST, [](AsyncWebServerRequest *request){
                        if (!request->hasParam("file", true) || !request->hasParam("mode", true)) {
                            request->send(400, "text/plain", "Missing file or mode param");
                            return;
                        }
                        String file = request->getParam("file", true)->value();
                        String mode = request->getParam("mode", true)->value();
                        int handle = pm.openFile(file, mode);
                        if (handle == 0) {
                            request->send(500, "text/plain", "Failed to open file");
                        } else {
                            request->send(200, "application/json", String(handle));
                        }
                    });

                    // PMachine file close
                    server.on("/pmachine/file/close", HTTP_POST, [](AsyncWebServerRequest *request){
                        if (!request->hasParam("handle", true)) {
                            request->send(400, "text/plain", "Missing handle param");
                            return;
                        }
                        int handle = request->getParam("handle", true)->value().toInt();
                        bool ok = pm.closeFile(handle);
                        request->send(ok ? 200 : 500, "text/plain", ok ? "Closed" : "Failed to close");
                    });

                    // PMachine file read line
                    server.on("/pmachine/file/readline", HTTP_GET, [](AsyncWebServerRequest *request){
                        if (!request->hasParam("handle")) {
                            request->send(400, "text/plain", "Missing handle param");
                            return;
                        }
                        int handle = request->getParam("handle")->value().toInt();
                        String line;
                        bool ok = pm.readLine(handle, line);
                        if (!ok) {
                            request->send(404, "text/plain", "No line or invalid handle");
                        } else {
                            request->send(200, "text/plain", line);
                        }
                    });

                    // PMachine file write line
                    server.on("/pmachine/file/writeline", HTTP_POST, [](AsyncWebServerRequest *request){
                        if (!request->hasParam("handle", true) || !request->hasParam("line", true)) {
                            request->send(400, "text/plain", "Missing handle or line param");
                            return;
                        }
                        int handle = request->getParam("handle", true)->value().toInt();
                        String line = request->getParam("line", true)->value();
                        bool ok = pm.writeLine(handle, line);
                        request->send(ok ? 200 : 500, "text/plain", ok ? "Written" : "Failed to write");
                    });
                #endif
                // FFS: Create directory endpoint
                server.on("/ffs/mkdir", HTTP_POST, [](AsyncWebServerRequest *request){
                    if (!request->hasParam("dir", true)) {
                        request->send(400, "text/plain", "Missing dir param");
                        return;
                    }
                    String dir = request->getParam("dir", true)->value();
                    bool ok = false;
            #if defined(ESP32)
                    if (dir.startsWith("sd/")) {
                        String sdPath = dir.substring(3);
                        ok = SD.mkdir(sdPath);
                    } else {
                        ok = LittleFS.mkdir(dir);
                    }
            #else
                    ok = LittleFS.mkdir(dir);
            #endif
                    request->send(ok ? 200 : 500, "text/plain", ok ? "Directory created" : "Failed to create directory");
                });

                // FFS: Remove directory endpoint
                server.on("/ffs/rmdir", HTTP_POST, [](AsyncWebServerRequest *request){
                    if (!request->hasParam("dir", true)) {
                        request->send(400, "text/plain", "Missing dir param");
                        return;
                    }
                    String dir = request->getParam("dir", true)->value();
                    bool ok = false;
            #if defined(ESP32)
                    if (dir.startsWith("sd/")) {
                        String sdPath = dir.substring(3);
                        ok = SD.rmdir(sdPath);
                    } else {
                        ok = LittleFS.rmdir(dir);
                    }
            #else
                    ok = LittleFS.rmdir(dir);
            #endif
                    request->send(ok ? 200 : 500, "text/plain", ok ? "Directory removed" : "Failed to remove directory");
                });

                // FFS: Delete file endpoint
                server.on("/ffs/delete", HTTP_POST, [](AsyncWebServerRequest *request){
                    if (!request->hasParam("file", true)) {
                        request->send(400, "text/plain", "Missing file param");
                        return;
                    }
                    String file = request->getParam("file", true)->value();
                    FFSStatus st = federatedFS.remove(file);
                    request->send(st == FFSStatus::OK ? 200 : 500, "text/plain", st == FFSStatus::OK ? "File deleted" : "Failed to delete file");
                });

                // FFS: Upload file endpoint (raw body)
                server.on("/ffs/upload", HTTP_POST, [](AsyncWebServerRequest *request){
                    if (!request->hasParam("file", true)) {
                        request->send(400, "text/plain", "Missing file param");
                        return;
                    }
                    String file = request->getParam("file", true)->value();
                    // Get raw body data
                    if (!request->hasParam("body", true)) {
                        request->send(400, "text/plain", "Missing body param");
                        return;
                    }
                    String body = request->getParam("body", true)->value();
                    std::vector<uint8_t> data(body.begin(), body.end());
                    FFSStatus st = federatedFS.write(file, data.data(), data.size());
                    request->send(st == FFSStatus::OK ? 200 : 500, "text/plain", st == FFSStatus::OK ? "File uploaded" : "Failed to upload file");
                });
            // FFS: List files endpoint
            server.on("/ffs/list", HTTP_GET, [](AsyncWebServerRequest *request){
                std::vector<String> files;
                if (federatedFS.listFiles(files) != FFSStatus::OK) {
                    request->send(500, "application/json", "[]");
                    return;
                }
                String json = "[";
                for (size_t i = 0; i < files.size(); ++i) {
                    if (i > 0) json += ",";
                    json += "\"" + files[i] + "\"";
                }
                json += "]";
                request->send(200, "application/json", json);
            });

