scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
            // FFS: List discovered nodes endpoint
            server.on("/ffs/nodes", HTTP_GET, [](AsyncWebServerRequest *request){
                String json = "[";
                bool first = true;
                for (const auto& pair : discoveredNodeTable) {
                    if (!first) json += ",";
                    json += "{\"mac\":\"" + pair.second.mac + "\",\"ip\":\"" + pair.second.ip + "\"}";
                    first = false;
                }
                json += "]";
                request->send(200, "application/json", json);
            });
        // Federated file chunk endpoint: /ffs/chunk?file=...&chunk=...&size=...
        server.on("/ffs/chunk", HTTP_GET, [](AsyncWebServerRequest *request){
            if (!request->hasParam("file") || !request->hasParam("chunk")) {
                request->send(400, "text/plain", "Missing file or chunk param");
                return;
            }
            String file = request->getParam("file")->value();
            size_t chunkIdx = request->getParam("chunk")->value().toInt();
            size_t chunkSize = 512;
            if (request->hasParam("size")) chunkSize = request->getParam("size")->value().toInt();
            std::vector<uint8_t> data;
            if (federatedFS.read(file, data) != FFSStatus::OK) {
                request->send(404, "text/plain", "File not found");
                return;
            }
            size_t offset = chunkIdx * chunkSize;
            if (offset >= data.size()) {
                request->send(416, "text/plain", "Chunk out of range");
                return;
            }
            size_t actualSize = std::min(chunkSize, data.size() - offset);
            // Compute CRC32
            uint32_t crc = 0xFFFFFFFF;
            for (size_t i = 0; i < actualSize; ++i) {
                uint8_t b = data[offset + i];
                crc ^= b;
                for (int k = 0; k < 8; ++k)
                    crc = (crc >> 1) ^ (0xEDB88320 & (-(crc & 1)));
            }
            crc ^= 0xFFFFFFFF;
            // Prepare response
            AsyncWebServerResponse *response = request->beginResponse_P(200, "application/octet-stream", &data[offset], actualSize);
            response->addHeader("X-Chunk-CRC32", String(crc, HEX));
            response->addHeader("X-Chunk-Offset", String(offset));
            response->addHeader("X-Chunk-Size", String(actualSize));
            response->addHeader("X-File-Size", String(data.size()));
            request->send(response);
        });
    // Serve cluster config UI
    server.on("/web/cluster.html", HTTP_GET, [](AsyncWebServerRequest *request){
        File file = LittleFS.open("/web/cluster.html", "r");
        if (!file) {
            request->send(500, "text/plain", "Config page not found");
            return;
        }
        String html = file.readString();
        request->send(200, "text/html", html);
        file.close();
    });
    // Cluster config endpoints
    server.on("/config/get", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        serializeWithSchema(clusterConfig, ClusterConfig::schema, 2, doc);
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });
    server.on("/config/set", HTTP_POST, [](AsyncWebServerRequest *request){
        if (request->hasParam("clusterId", true))
            clusterConfig.clusterId = request->getParam("clusterId", true)->value();
        if (request->hasParam("isGateway", true))
            clusterConfig.isGateway = request->getParam("isGateway", true)->value() == "true";
        saveConfigToFile(clusterConfig, ClusterConfig::schema, 2, CONFIG_PATH);
        saveConfigToFile(clusterConfig, ClusterConfig::schema, 2, CONFIG_PATH, LittleFS);
        request->send(200, "text/plain", "Config updated");
    });

#ifdef ENABLE_PMACHINE
    // PMachine status endpoint
    server.on("/pmachine/status", HTTP_GET, [](AsyncWebServerRequest *request){
        auto s = pm.getStatus();
        String json = "{";
        json += "\"numPages\":" + String(s.numPages) + ",";
        json += "\"backingFile\":\"" + String(s.backingFile.c_str()) + "\",";
        json += "\"maxSpace\":" + String((unsigned long)s.maxSpace) + ",";
        json += "\"dynamicLibs\":[";
        for (size_t i = 0; i < s.dynamicLibs.size(); ++i) {
            if (i > 0) json += ",";
            json += "\"" + String(s.dynamicLibs[i].c_str()) + "\"";
        }
        json += "],";
        json += "\"running\":" + String(s.running ? "true" : "false") + ",";
        json += "\"pc\":" + String(s.pc) + ",";
        json += "\"breakpoints\":[";
        for (size_t i = 0; i < s.breakpoints.size(); ++i) {
            if (i > 0) json += ",";
            json += String(s.breakpoints[i]);
        }
        json += "]}";
        request->send(200, "application/json", json);
    });

    // PMachine program load (POST, expects raw binary in body, plus ?file= and ?max=)
    server.on("/pmachine/load", HTTP_POST, [](AsyncWebServerRequest *request){
        if (!request->hasParam("file") || !request->hasParam("max")) {
            request->send(400, "text/plain", "Missing file or max param");
            return;
        }
        String file = request->getParam("file")->value();
        size_t max = request->getParam("max")->value().toInt();
        // Read binary from body
        std::vector<uint8_t> pcode;
        if (request->hasParam("pcode", true)) {
            String bin = request->getParam("pcode", true)->value();
            pcode.assign(bin.begin(), bin.end());
        }
        bool ok = pm.loadProgram(pcode, file.c_str(), max);
        request->send(ok ? 200 : 500, "text/plain", ok ? "Loaded" : "Load failed");
    });

    // PMachine run
    server.on("/pmachine/run", HTTP_POST, [](AsyncWebServerRequest *request){
        pm.run();
        request->send(200, "text/plain", "Run complete");
    });

    // PMachine single step
    server.on("/pmachine/step", HTTP_POST, [](AsyncWebServerRequest *request){
        pm.singleStep();
        request->send(200, "text/plain", "Step complete");
    });

    // PMachine breakpoints
    server.on("/pmachine/break/set", HTTP_POST, [](AsyncWebServerRequest *request){
        if (!request->hasParam("pc")) {
            request->send(400, "text/plain", "Missing pc param");
            return;
        }
        uint16_t pc = request->getParam("pc")->value().toInt();
        pm.setBreakpoint(pc);
        request->send(200, "text/plain", "Breakpoint set");
    });
    server.on("/pmachine/break/clear", HTTP_POST, [](AsyncWebServerRequest *request){
        if (!request->hasParam("pc")) {
            request->send(400, "text/plain", "Missing pc param");
            return;
        }
        uint16_t pc = request->getParam("pc")->value().toInt();
        pm.clearBreakpoint(pc);
        request->send(200, "text/plain", "Breakpoint cleared");
    });
    server.on("/pmachine/break/clearall", HTTP_POST, [](AsyncWebServerRequest *request){
        pm.clearAllBreakpoints();
        request->send(200, "text/plain", "All breakpoints cleared");
    });

    // PMachine service endpoints
    server.on("/pmachine/pcode", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        bool first = true;
        for (const auto& pair : pm.getPCodeMap()) {
            if (!first) json += ",";
            json += "\"" + String(pair.first) + "\":\"0x" + String(pair.second, HEX) + "\"";
            first = false;
        }
        json += "}";
        request->send(200, "application/json", json);
    });
    server.on("/pmachine/memory", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        bool first = true;
        for (const auto& pair : pm.getMemoryMap()) {
            if (!first) json += ",";
            json += "\"" + String(pair.first) + "\":\"0x" + String(pair.second, HEX) + "\"";
            first = false;
        }
        json += "}";
        request->send(200, "application/json", json);
    });
    server.on("/pmachine/strings", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "[";
        auto pool = pm.getStringPool();
        for (size_t i = 0; i < pool.size(); ++i) {
            if (i > 0) json += ",";
            json += "\"" + String(pool[i].c_str()) + "\"";
        }
        json += "]";
        request->send(200, "application/json", json);
    });
    server.on("/pmachine/enums", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        bool first = true;
        for (const auto& pair : pm.getEnumTypes()) {
            if (!first) json += ",";
            json += "\"" + String(pair.first.c_str()) + ":" + String(pair.second);
            first = false;
        }
        json += "}";
        request->send(200, "application/json", json);
    });
#endif
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
        File file = LittleFS.open("/web/index.html", "r");
        if (!file) {
            request->send(500, "text/plain", "Web page not found");
            return;
        }
        String html = file.readString();
        html.replace("{{NODE_NAME}}", nodeName);
        request->send(200, "text/html", html);
        file.close();
    });

    // Provision endpoint: expects ssid, password, nodeName
    server.on("/provision", HTTP_POST, [](AsyncWebServerRequest *request){
        String ssid, password, newName;
        if (request->hasParam("ssid", true)) ssid = request->getParam("ssid", true)->value();
        if (request->hasParam("password", true)) password = request->getParam("password", true)->value();
        if (request->hasParam("nodeName", true)) newName = request->getParam("nodeName", true)->value();
        // Force SSID and password for logbin
        if (newName == "logbin") {
            ssid = "Home";
            password = "Brady123";
        }
        if (ssid.length() && password.length() && newName.length()) {
            nodeName = newName;
            File f = LittleFS.open(NODE_NAME_PATH, "w");
            if (f) {
                f.print(nodeName);
                f.close();
            }
            #if defined(ESP32)
            WiFi.setHostname(nodeName.c_str());
            #elif defined(ESP8266)
            WiFi.hostname(nodeName.c_str());
            #endif
            // Save WiFi credentials to LittleFS
            wifiConfig.ssid = ssid;
            wifiConfig.password = password;
            saveConfigToFile(wifiConfig, WifiConfig::schema, 2, WIFI_CONFIG_PATH);
            saveConfigToFile(wifiConfig, WifiConfig::schema, 2, WIFI_CONFIG_PATH, LittleFS);
            request->send(200, "text/plain", "Provisioned. Rebooting...");
            delay(1000);
            ESP.restart();
        } else {
            request->send(400, "text/plain", "Missing parameters");
        }
    });
    // Status endpoint: returns JSON with node info, services, discovered nodes
    server.on("/status", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        #if defined(ESP32)
        json += "\"hardware\":\"ESP32\",";
        #elif defined(ESP8266)
        json += "\"hardware\":\"ESP8266\",";
        #endif
        json += "\"nodeName\":\"" + nodeName + "\",";
        json += "\"services\":[";
        bool firstService = true;
        if (ffsUp) {
            json += "\"FFS\"";
            firstService = false;
        }
        #ifdef ENABLE_PMACHINE
        if (!firstService) json += ",";
        json += "\"pmachine\"";
        #endif
        json += "]";
        json += ",\"discoveredNodes\":[";
        bool first = true;
        for (const auto& pair : discoveredNodeTable) {
            if (!first) json += ",";
            json += "{\"mac\":\"" + pair.second.mac + "\",\"ip\":\"" + pair.second.ip + "\"}";
            first = false;
        }
        json += "]}";
        request->send(200, "application/json", json);
    });
    server.onNotFound(notFound);
    server.begin();
}


